layer {
  name: "input"
  type: "Input"
  top: "input"
  input_param {
    shape {
      dim: 1
      dim: 1
      dim: 18
      dim: 192
      dim: 192
    }
  }
}
layer {
  name: "convi"
  type: "Convolution"
  bottom: "input"
  top: "convi"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 1
  }
  convolution_param {
    num_output: 28
    bias_term: true
    pad: 0
    pad: 2
    pad: 2
    kernel_size: 1
    kernel_size: 5
    kernel_size: 5
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
      std: 1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer { 
    type: 'DummyData' 
    name: 'dummy_data' 
    top: 'dummy_data' 
    top: 'label'
    dummy_data_param { 
         shape {
          dim: 1
          dim: 3 
          dim: 14 
          dim: 180 
          dim: 180 
        }
    }
}

layer {
  name: "crop_layer"
  type: "Crop"
  bottom: "convi"
  bottom: "dummy_data"
  top: "affinity"
  crop_param {
    axis: 2 
    offset: 2  
    offset: 6 
    offset: 6 
  }
}

