layer {
  name: "bnorm_[LAYER_NUMBER]"
  type: "BatchNorm"
  bottom: "[BOT_TENSOR]"
  top: "[TOP_TENSOR]"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    use_global_stats: true
  }
} 
