layer {
  name: "input"
  type: "Input"
  top: "input"
  input_param {
    shape {
	dim: 2 
	dim: 1 
	dim: 1
	dim: 5
	dim: 5
    }
  }
}
layer {
  name: "deconv_0"
  type: "Deconvolution"
  bottom: "input"
  top: "tensor_0"

  param {
    lr_mult: 1
  }

  convolution_param {
    num_output: 1 
    bias_term: true
    kernel_size: 1
    kernel_size: 3 
    kernel_size: 3 
    stride: 1
    stride: 3 
    stride: 3 
    pad: 0
    pad: 0 
    pad: 0 
    weight_filler {
      type: "msra"
      std: 1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv_1"
  type: "Convolution"
  bottom: "tensor_0"
  top: "output"
  convolution_param {
    num_output: 1 
    bias_term: true
    kernel_size: 1 
    kernel_size: 3 
    kernel_size: 3 
    stride: 1
    stride: 1 
    stride: 1
    pad: 0
    pad: 0 
    pad: 0 
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
