layer {
  name: "pool_[LAYER_NUMBER]"
  type: "Pooling"
  bottom: "[BOT_TENSOR]"
  top: "[TOP_TENSOR]"
  pooling_param {
    pool: MAX
    kernel_size: 1
    kernel_size: 2
    kernel_size: 2
    stride: 1
    stride: 2
    stride: 2
  }
}
