name: "unet-conv4"
input: "data"
input_dim: 1
input_dim: 512
input_dim: 66
input_dim: 66
force_backward: true
layers {
  name: "conv1/3x3_s1"
  type: CONVOLUTION
  bottom: "data"
  top: "conv1/3x3_s1"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 512
    kernel_size: 3
    pad: 0
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}