layer {
  name: "input"
  type: "Input"
  top: "input"
  input_param {
    shape {
	dim: 1 
	dim: 8 
	dim: 18
	dim: 192
	dim: 192
    }
  }
}
layer {
  name: "conv"
  type: "Convolution"
  bottom: "input"
  top: "conv_o"
  convolution_param {
    num_output: 1 
    bias_term: true
    kernel_size: 2 
    kernel_size: 1 
    kernel_size: 1 
    stride: 1
    stride: 1 
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
