layer {
  name: "input"
  type: "Input"
  top: "data"
  input_param {
    shape {
	dim: 1
	dim: 8 
	dim: 18 
	dim: 192
	dim: 192
    }
  }
}
layer {
  name: "conv"
  type: "Convolution"
  bottom: "data"
  top: "result"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 1
  }
  convolution_param {
    num_output: 24
    bias_term: true
    kernel_size: 1
    kernel_size: 4
    kernel_size: 4
    stride: 1
    stride: 1 
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
